[
{"maintext": "A Kingston FURY, divisão de games da Kingston, anunciou nesta quarta-feira (25) a linha de\n memórias DDR5 Kingston FURY Beast RGB com frequência de até 6000MT/s\n. Com certificação \nIntel\n XMP 3.0 as memórias contam com RGB customizável, novo dissipador de calor e chegam com modelos de 8GB, 16GB, 32GB e até 64GB com kit de combinação dupla.\nA gerente de negócios de DRAM da Kingston Iwona Zalewska, afirma que a empresa está feliz em anunciar a linha de memórias Kingston FURY Beast DDR5 e que usuários poderão aproveitar o melhor do DDR5 com RGB customizável. \"Aqueles que querem o poder do DDR5 junto da aparência divertida do RGB poderão aproveitar ambos. Com a possibilidade de adicionar um toque pessoal ao customizar os efeitos de luz, usuários podem tomar nas suas mãos a experiência gamer completa\". \nTodos os modelos de memórias DDR5 Kingston FURY Beast apresentam a tecnologia patenteada Kingston FURY Infrared Sync que irão manter os efeitos RGB das memórias em perfeita sintonia com o restante do sistema. \nAs memórias DDR5 começam com frequências de 4800MT/s com a função Plug N Play da Kingston que realiza overclock automático sem que o usuário precise escolher. Nos modulos de 5200MT/s e 6000MT/s o Intel XMP 3.0 (Extreme Memory Profile) permite travar a velocidade, timing e voltagem do overclock, para que tanto usuários experientes quanto entusiastas iniciantes possam aproveitar as memórias DDR5 Kingston FURY Beast.\nIluminação aprimorada com novo design para dissipar calor que aprimora a iluminação RGB e Tecnologia patenteada Kingston FURY Infrared Sync;\nCertificação Intel CMP 3.0;\nEstabilidade aprimorada para overclocking: On-Die ECC auxilia na manutenção da integridade dos dados;\nPlug N Play em frequências de 4800MT/s com auto overclocking de acordo com a velocidade permitida pela BIOS do sistema;\nCapacidades de 8GB, 16GB e 32GB. Kits com 2 memórias para capacidades de: 16GB, 32GB e 64GB.\nFrequências de 4800MT/s, 5200MT/s, 5600MT/s, 6000MT/s;\nLatencia: CL38, CL40\nVoltagem1.1 V, 1.25 V e 1.35 V, respectivamente\nDimensões: 33.35 mm x 42.23 mm x 7.11 mm \n"}
]